<?php 
    $test = array(
        [
            "number"=>"ข้อที่ 1",
            "content"=>"การจัดการศึกษาในข้อใดมีความสอดคล้องกับการพัฒนาผู้เรียนให้มีคุณลักษณะในศตวรรษที่ 21 มากที่สุด",
            "choice"=>[
                "ก. การพัฒนาระบบการส่งงานด้วย Google Classroom",
                "ข. การพัฒนาทักษะการอ่านจับใจความสำคัญด้วยบทเรียนสำเร็จรูป",
                "ค. การแก้ไขปัญหาพฤติกรรมการมาโรงเรียนสายด้วยการทำข้อตกลงกับผู้ปกครอง",
                "ง. การพัฒนาทักษะการใช้เครื่องมือทดลองด้วยรูปแบบการเรียนการสอนแบบสาธิต",
                "จ. การพัฒนาความคิดสร้างสรรค์และการทำงานแบบร่วมมือโดยใช้รูปแบบการสอนปัญหาเป็นฐาน"
            ],
            "ans"=>"ง. การพัฒนาทักษะการใช้เครื่องมือทดลองด้วยรูปแบบการเรียนการสอนแบบสาธิต"
        ],
        [
            "number"=>"ข้อที่ 2",
            "content"=>"การกำหนดรายละเอียดในแต่ละองค์ประกอบของหลักสูตรควรพิจารณาสิ่งใดเป็นสำคัญ",
            "choice"=>[
                "ก. ความเหมาะสมกับบริบทของผู้เรียน ชุมชน และสังคม",
                "ข. ทักษะการเรียนรู้ และทักษะการดำเนินชีวิต",
                "ค. ความรู้ ทักษะ และคุณลักษณะอันพึงประสงค์",
                "ง. มาตรฐานและตัวชี้วัดของหลักสูตร",
                "จ. คำอธิบายรายวิชา และจุดมุ่งหมายของหลักสูตรแกนกลาง"
            ],
            "ans"=>"ก. ความเหมาะสมกับบริบทของผู้เรียน ชุมชน และสังคม"
        ],
        [
            "number"=>"ข้อที่ 3",
            "content"=>"ข้อใดต่อไปนี้เป็นขั้นตอนหรือกระบวนที่สอดคล้องกับการปรับปรุงหลักสูตร",
            "choice"=>[
                "ก. พัฒนาสื่อการเรียนการสอนแล้วประเมินผลการเรียนรู้",
                "ข. ศึกษาข้อมูลเพื่อนำมากำหนดองค์ประกอบของหลักสูตร",
                "ค. วิชัยและติดตามการใช้หลักสูตรแล้วแก้ไข เพิ่มเติม และพัฒนาหลักสูตรให้ทันสมัย",
                "ง. ทดสอบผสสัมฤทธิ์ทางการเรียนที่ตามจุดมุ่งหมายของหลักสูตร",
                "จ. ศึกษาข้อมูลเพื่อนำมาวิเคราะห์แนวทางการจัดการเรียนรู้"
            ],
            "ans"=>"ค. วิชัยและติดตามการใช้หลักสูตรแล้วแก้ไข เพิ่มเติม และพัฒนาหลักสูตรให้ทันสมัย"
        ],
        [
            "number"=>"ข้อที่ 4",
            "content"=>"จากการที่ครูได้สำรวจผู้เรียน พบว่า ผู้เรียนไม่สามารถปรับตัวได้ ขาดความยืดหยุ่นท้อแท้ง่ายต่อปัญหาและอุปสรรค จากข้อมูลดังกล่าวเกิดจากสาเหตุใด",
            "choice"=>[
                "ก. นักเรียนมีปัญหาด้านอารมณ์",
                "ข. นักเรียนมีปัญหาด้านการขาดทักษะการแก้ไขปัญหา",
                "ค. นักเรียนมีปัญหาด้านบุคลิกภาพและแสดงออก",
                "ง. นักเรียนมีปัญหาด้านพัฒนาการด้านสติปัญญา",
                "จ. นักเรียนมีปัญหาด้านคุณธรรม จริยธรรม"
            ],
            "ans"=>"ข. นักเรียนมีปัญหาด้านการขาดทักษะการแก้ไขปัญหา"
        ],
        [
            "number"=>"ข้อที่ 5",
            "content"=>"กระบวนการที่สำคัญของการบริหารจัดการชุมชนตามหลักปรัชญาของเศรษฐกิจพอเพียงคือข้อใด",
            "choice"=>[
                "ก. ชุมขนร่วมกันวางแผน ร่วมกันปฏิบัติ และร่วมกันประเมินผล",
                "ข. ชุมชนร่วมกันจัดตั้งกลุ่ม ปรัชญาเศรษฐกิจพอเพียง",
                "ค. ชุมชนร่วมกันพัฒนาระบบขนส่งผลิตภัณฑ์ในชุมชน",
                "ง. ชุมชนร่วมกันระดมทรัพยากรต่าง ๆ เพื่อดำเนินงาน",
                "จ. ชุมชนร่วมกันพัฒนาผลิตภัณฑ์ในชุมชน"
            ],
            "ans"=>"ก. ชุมขนร่วมกันวางแผน ร่วมกันปฏิบัติ และร่วมกันประเมินผล"
        ],
        [
            "number"=>"ข้อที่ 6",
            "content"=>"ในการจัดการเรียนการสอน เรื่อง ป่าไม้ในประเทศไทย ให้กับนักเรียนชั้นประถมศึกษาปีที่ 6 สื่อการเรียนการสอนในข้อใดมีความเหมาะสมมากที่สุด",
            "choice"=>[
                "ก. รูปภาพและคำอธิบายประเภทป่าไม้",
                "ข. ข่าวเกี่ยวกับการตัดไม้ทำลายป่าจากหนังสือพิมพ์",
                "ค. หนังสือที่รวบรวมข้อมูลเกี่ยวกับป่าไม้ในประเทศไทย",
                "ง. บทความวิจัยเรื่องการใช้ประโยชน์จากป่าไม้ในประเทศไทย",
                "จ. คลิปวิดีโอการสัมภาษณ์ผู้เชี่ยวชาญด้านป่าไม้ในประเทศไทย"
            ],
            "ans"=>"ก. รูปภาพและคำอธิบายประเภทป่าไม้"
        ],
        [
            "number"=>"ข้อที่ 7",
            "content"=>"ข้อใดต่อไปนี้เป็นการกำหนดจุดประสงค์การเรียนรู้ที่เน้นทักษะพิสัยมากที่สุด",
            "choice"=>[
                "ก. เห็นความสำคัญของการสื่อการอย่างถูกต้องตามหลักไวยากรณ์",
                "ข. อธิบายความสัมพันธ์ของระบบเศรษฐกิจที่มีผลต่อการดำเนินชีวิต",
                "ค. อธิปรายความสำคัญของการอนุรักษ์วัฒนธรรมไทยและภูมิปัญญาท้องถิ่น",
                "ง. นำหลักการของการเขียนสร้างสรรค์ไปใช้ในการสื่อสารในชีวิตประจำวันได้",
                "จ. อธิบายปัญหาสิ่งแวดล้อมที่ส่งผลกระทบต่อความสัมพันธ์ของสิ่งมีชีวิตในระบบนิเวศ"
            ],
            "ans"=>"ง. นำหลักการของการเขียนสร้างสรรค์ไปใช้ในการสื่อสารในชีวิตประจำวันได้"
        ],
        [
            "number"=>"ข้อที่ 8",
            "content"=>"องค์ประกอบของหลักสูตรสถานศึกษาในข้อใดต่อไปนี้ระบุถึงจุดเน้นของสถานศึกษา",
            "choice"=>[
                "ก. คำอธิบายรายวิชา",
                "ข. กิจกรรมการพัฒนาผู้เรียน",
                "ค. แนวทางการจัดการเรียนรู้",
                "ง. เกณฑ์การสำเร็จการศึกษา",
                "จ. วิสัยทัศน์ของหลักสูตรสถานศึกษา"
            ],
            "ans"=>"จ. วิสัยทัศน์ของหลักสูตรสถานศึกษา"
        ],
        [
            "number"=>"ข้อที่ 9",
            "content"=>"การกำหนดองค์ประกอบของหลักสูตรสถานศึกษา ควรพิจารณาหรือคำนึงถึงสิ่งใดมากที่สุด",
            "choice"=>[
                "ก. ความต้องการของบุคลากรในสถานศึกษา",
                "ข. มติที่ประชุมของคณะกรรมการสถานศึกษา",
                "ค. ความต้องการจำเป็นจากหน่วยงานต้นสังกัด",
                "ง. คำอธิบายและโครงสร้างตามหลักสูตรระดับชั้นเรียน",
                "จ. จุดเน้นของสถานศึกษาและมาตรฐานการเรียนรู้ตามหลักสูตรแกนกลาง"
            ],
            "ans"=>"จ. จุดเน้นของสถานศึกษาและมาตรฐานการเรียนรู้ตามหลักสูตรแกนกลาง"
        ],
        [
            "number"=>"ข้อที่ 10",
            "content"=>"รูปแบบการเรียนการสอนตามข้อใดต่อไปนี้เป็นการจัดการเรียนรู้ที่เน้นประสบการณ์ตรงในการประยุกต์ใช้ความรู้ในการแก้ไขปัญหาในสถานการณ์ที่กำหนดให้กับผู้เรียน",
            "choice"=>[
                "ก. รูปแบบการเรียนการสอนแบบ Inquiry",
                "ข. รูปแบบการเรียนการสอนแบบ Case Study",
                "ค. รูปแบบการเรียนการสอนแบบ Simulation",
                "ง. รูปแบบการเรียนการสอนแบบ Role Playing",
                "จ. รูปแบบการเรียนการสอนแบบ Dramatization"
            ],
            "ans"=>"ค. รูปแบบการเรียนการสอนแบบ Simulation"
        ],
        [
            "number"=>"ข้อที่ 11",
            "content"=>"สังคมปัจจุบันเยาวชนอยู่ในยุของวัตถุนิยมบทบาทครูผู้สอนจำเป็นต้องนำหลักปรัชญาของเศษฐกิจพอเพียงมาประยุกต์ใช้ในการเรียนการสอนอย่างไร",
            "choice"=>[
                "ก. เสริมแรงนักเรียนที่มีการปฏิบัติตนเป็นต้นแบบ",
                "ข. ปฏิบัติตนเป็นต้นแบบตามหลักปรัชญาของเศรษฐกิจพอเพียง",
                "ค. จัดกิจกรรมเพื่อส่งเสริมตามหลักปรัชญาของเศรษฐกิจพอเพียง",
                "ง. สอดแทรกความรู้หลักปรัชญาของเศรษฐกิจพอเพียงในทุกรายวิชา",
                "จ. ให้นักเรียนศึกษาตัวอย่างบุคคลที่ใช้หลักปรัชญาของเศรษฐกิจพอเพียง"
            ],
            "ans"=>"ข. ปฏิบัติตนเป็นต้นแบบตามหลักปรัชญาของเศรษฐกิจพอเพียง"
        ],
        [
            "number"=>"ข้อที่ 12",
            "content"=>"การนำปรัชญาเศรษฐกิจพอเพียงไปบูรณาการในการเรียนการสอนเพื่อให้เกิดผลต่อการพัฒนาชุมชน ครูควรจัดกิจกรรมการสอนอย่างไร",
            "choice"=>[
                "ก. เป็นผู้นำเศรษฐกิจพอเพียงในชุมชน",
                "ข. เรียนรู้ปรัชญาเศรษฐกิจพอเพียงจากชุมชน",
                "ค. รณรงค์การใช้ปรัชญาเศรษฐกิจพอเพียงในชุมชน",
                "ง. เป็นวิทยากรให้ความรู้ ด้านปรัชญาเศรษฐกิจพอเพียงให้ชุมชน",
                "จ. นำนักเรียนไปช่วยพัฒนาชุมชน ด้วยหลักปรัชญาเศรษฐกิจพอเพียง"
            ],
            "ans"=>"ค. รณรงค์การใช้ปรัชญาเศรษฐกิจพอเพียงในชุมชน"
        ],
        [
            "number"=>"ข้อที่ 13",
            "content"=>"ครูสามารถนำปรัชญาเศษฐกิจพอเพียงมาประยุกใช้ในการพัฒนาตน พัฒนางาน โดยต้องเน้นความสำคัญในด้านใดมากที่สุด",
            "choice"=>[
                "ก. พัฒนาทักษะ",
                "ข. พัฒนาความรู้",
                "ค. พัฒนาคุณธรรม",
                "ง. พัฒนาความสัมพันธ์กับชุมชน",
                "จ. พัฒนาความสัมพันธ์กับเพื่อนร่วมงาน"
            ],
            "ans"=>"ค. พัฒนาคุณธรรม"
        ],
        [
            "number"=>"ข้อที่ 14",
            "content"=>"กระบวนการที่สำคัญของการบริหารจัดการชุมชนตามหลักปรัชญาของเศรษฐกิจพอเพียง",
            "choice"=>[
                "ก. ชุมชนร่วมกันพัฒนาผลิตภัณฑ์ในชุมชน",
                "ข. ชุมชนร่วมกันจัดตั้งกลุ่ม ปรัชญาเศรษฐกิจพอเพียง",
                "ค. ชุมชนร่วมกันพัฒนาระบบขนส่งผลิตภัณฑ์ในชุมชน",
                "ง. ชุมชนร่วมกันระดมทรัพยากรต่าง ๆ เพื่อดำเนินงาน",
                "จ. ชุมชนร่วมกันวางแผน ร่วมกันปฏิบัติ และร่วมกันประเมินผล"
            ],
            "ans"=>"จ. ชุมชนร่วมกันวางแผน ร่วมกันปฏิบัติ และร่วมกันประเมินผล"
        ],
        [
            "number"=>"ข้อที่ 15",
            "content"=>"สิ่งที่สนับสนุนให้เกิดการพัฒนากระบวนการเรียนรู้และการสอนที่มีประสิทธิภาพในสถานศึกษา คือข้อใด",
            "choice"=>[
                "ก. การวิจัยเพื่อพัฒนาการเรียนรู้",
                "ข. การปรับปรุงและพัฒนาหลักสูตรสถานศึกษา",
                "ค. การจัดทำแผนปฏิบัติราชการประจำปีงบประมาณ",
                "ง. การทำแผนการจัดการเรียนรู้และการบันทึกหลังสอน",
                "จ. การจัดประชุมสามัญและวิสามัญทุกสุดสัปดาห์และสะท้อนผลทุกเดือน"
            ],
            "ans"=>"ก. การวิจัยเพื่อพัฒนาการเรียนรู้"
        ],
        [
            "number"=>"ข้อที่ 16",
            "content"=>"ข้อใดอธิบายถึงองค์ประกอบของการศึกษาเพื่อการพัฒนาที่ยั่งยืนที่ชัดเจนที่สุด",
            "choice"=>[
                "ก. การตัดสินใจด้านการศึกษา",
                "ข. การร่วมมือกับองค์กร หรือหน่วยงานต่างๆ ในการจัดการศึกษา",
                "ค. การจัดการศึกษาให้กับประชากรกลุ่มที่ไม่อยู่ในกลุ่มของการศึกษาในระบบ",
                "ง. การศึกษาสร้างคุณภาพชีวิต โดยการนำผลการวิจัยมาตัดสินใจในการพัฒนาการศึกษา",
                "จ. การดำเนินงานของการศึกษา โดยการพัฒนาให้สมาชิกในสังคมสามารถรู้หนังสือในระดับสูง หรือในระดับชั้นการมีปัญญาแก้ไขปัญหา"
            ],
            "ans"=>"จ. การดำเนินงานของการศึกษา โดยการพัฒนาให้สมาชิกในสังคมสามารถรู้หนังสือในระดับสูง หรือในระดับชั้นการมีปัญญาแก้ไขปัญหา"
        ],
        [
            "number"=>"ข้อที่ 17",
            "content"=>"ข้อใดไม่ใช่ผลของการจัดการศึกษาเพื่อพัฒนาอย่างยังยืน",
            "choice"=>[
                "ก. สังคมที่มีการจัดการศึกษาตลอดชีวิต",
                "ข. สามารถใช้ทรัพยากรได้ตามความต้องการ",
                "ค. สิ่งแวดล้อมที่มีความหลากหลายทางชีวภาพ",
                "ง. การอยู่ร่วมกันฉันท์มิตรและมีความสุขที่ยังยืน",
                "จ. ความหลากหลายที่เป็นพหุวัฒนธรรมของประชากรโลก"
            ],
            "ans"=>"ข. สามารถใช้ทรัพยากรได้ตามความต้องการ"
        ],
        [
            "number"=>"ข้อที่ 18",
            "content"=>"การสร้างสังคมให้เป็นสังคมที่มีการศึกษาเพื่อการพัฒนาที่ยั่งยืนมีปัจจัยที่สนับสนุนให้เกิดความสำเร็จ ยกเว้นข้อใด",
            "choice"=>[
                "ก. ครูที่เป็นต้นแบบ",
                "ข. บุคลากรมีความคิดวิเคราะห์และสร้างสรรค์",
                "ค. มีเศรษฐกิจที่พอเพียงและไม่ทำลายสิ่งแวดล้อมจนเกิดภัยพิบัติ",
                "ง. หลักสูตรมาจากองค์ความรู้ที่มีครอบครัวและชุมชนเป็นฐานในการสร้าง",
                "จ. พัฒนาระบบการศึกษาและจัดหาสิ่งสนับสนุนด้วยทรัพยากรทั้งหมดที่มี"
            ],
            "ans"=>"จ. พัฒนาระบบการศึกษาและจัดหาสิ่งสนับสนุนด้วยทรัพยากรทั้งหมดที่มี"
        ],
        [
            "number"=>"ข้อที่ 19",
            "content"=>"ข้อใดเป็น หลักการสำคัญของการเลือกใช้สื่อการเรียนการสอนให้สอดคล้องกับหลักปัญาของเศรษฐกิจพอเพียงโดยคำนึงถึงความพอประมาณ ความมีเหตุผล ตลอดจนการใช้ความรู้ด้วยความรอบคอบ",
            "choice"=>[
                "ก. เลือกสื่อให้เหมาะสมกับนักเรียน",
                "ข. เลือกสื่อให้เหมาะสมกับวัตถุประสงค์",
                "ค. ใช้สื่อให้เหมาะสมกับบริบทของโรงเรียน",
                "ง. เลือกสื่อให้เหมาะสมกับความสามารถของครู",
                "จ. เลือกสื่อให้เหมาะสมกับการวัดและประเมินผล"
            ],
            "ans"=>"ค. ใช้สื่อให้เหมาะสมกับบริบทของโรงเรียน"
        ],
        [
            "number"=>"ข้อที่ 20",
            "content"=>"ข้อใดอธิบายถึงองค์ประกอบของการศึกษาเพื่อการพัฒนาที่ยั่งยืนที่ชัดเจนที่สุด",
            "choice"=>[
                "ก. การตัดสินใจด้านการศึกษา",
                "ข. การร่วมมือกับองค์กร หรือหน่วยงานต่างๆ ในการจัดการศึกษา",
                "ค. การจัดการศึกษาให้กับประชากรกลุ่มที่ไม่อยู่ในกลุ่มของการศึกษาในระบบ",
                "ง. การศึกษาสร้างคุณภาพชีวิต โดยการนำผลการวิจัยมาตัดสินใจในการพัฒนาการศึกษา",
                "จ. การดำเนินงานของการศึกษา โดยการพัฒนาให้สมาชิกในสังคมสามารถรู้หนังสือในระดับสูง หรือในระดับชั้นการมีปัญญาแก้ไขปัญหา"
            ],
            "ans"=>"จ. การดำเนินงานของการศึกษา โดยการพัฒนาให้สมาชิกในสังคมสามารถรู้หนังสือในระดับสูง หรือในระดับชั้นการมีปัญญาแก้ไขปัญหา"
        ],
        [
            "number"=>"ข้อที่ 21",
            "content"=>"การออกแบบการวิจัยในข้อใดต่อไปนี้สอดคล้องกับจุดมุ่งหมายเพื่อการศึกษาประสิทธิภาพสื่อการจัดการเรียนการสอนมากที่สุด",
            "choice"=>[
                "ก. การวิจัยเชิงสำรวจ",
                "ข. การวิจัยเชิงทดลอง",
                "ค. การวิจัยเชิงปฏิบัติการในชั้นเรียน",
                "ง. การวิจัยเชิงคุณภาพเพื่อศึกษาข้อมูลเชิงลึก",
                "จ. การวิจัยเชิงบรรยายเพื่ออธิบายปรากฏการณ์ที่เกิดขึ้นในชั้นเรียน"
            ],
            "ans"=>"ข. การวิจัยเชิงทดลอง"
        ],
        [
            "number"=>"ข้อที่ 22",
            "content"=>"ในการประเมินหลักสูตรด้วยรูปแบบ CPP Mode! การประเมินผลการเรียนรู้ของนักเรียนถือเป็นส่วนหนึ่งของการประเมินหลักสูตรด้านใด",
            "choice"=>[
                "ก. ผลผลิต",
                "ข. ผลลัพธ์",
                "ค. กระบวนการ",
                "ง. การดำเนินการ",
                "จ. ผลสะท้อนกลับ"
            ],
            "ans"=>"ก. ผลผลิต"
        ],
        [
            "number"=>"ข้อที่ 23",
            "content"=>"ชุมชนการเรียนรู้ทางวิชาชีพ (PLC) นำไปใช้ในการพัฒนาหลักสูตรได้ ยกเว้นข้อใด",
            "choice"=>[
                "ก. วางแผนร่วมกันในการกำหนดกรอบในการพัฒนาหลักสูตร",
                "ข. ประเมินหลักสูตรร่วมกันด้วยความร่วมแรงร่วมใจและร่วมมือ",
                "ค. ร่วมกันแบ่งปันความรู้ ทักษะ และเจตคติที่ดีต่อการพัฒนาหลักสูตร",
                "ง. แบ่งหน้าที่อย่างชัดเจนในแต่ละกระบวนการของการพัฒนาหลักสูตร",
                "จ. สร้างความรู้สึกผูกพันร่วมกันต่อการพัฒนาหลักสูตรเพื่อการพัฒนาผู้เรียน"
            ],
            "ans"=>"ง. แบ่งหน้าที่อย่างชัดเจนในแต่ละกระบวนการของการพัฒนาหลักสูตร"
        ],
        [
            "number"=>"ข้อที่ 24",
            "content"=>"หัวข้อการวิจัยในข้อใดต่อไปนี้ควรใช้สถิติเขิงอนุมานเพื่อการวิเคราะห์ข้อมูล",
            "choice"=>[
                "ก. การศึกษาสาเหตุพฤติกรรมการเก็บตัวและการเข้าสังคม",
                "ข. การพัฒนารูปแบบการเรียนรู้เพื่อเสริมสร้างความคิดสร้างสรรค์",
                "ค. การพัฒนาทักษะการคิดเชื่อมโยงด้วยสื่อการเรียนรู้แบบสร้างสรรค์",
                "ง. การพัฒนาความคิดสร้างสรรค์ด้วยรูปแบบการเรียนรู้โดยใช้ปัญหาเป็นฐาน",
                "จ. การศึกษาเปรียบเทียบรูปแบบการจัดการเรียนรู้แบบสถานการณ์จำลองกับการสอนปกติ"
            ],
            "ans"=>"จ. การศึกษาเปรียบเทียบรูปแบบการจัดการเรียนรู้แบบสถานการณ์จำลองกับการสอนปกติ"
        ],
        [
            "number"=>"ข้อที่ 25",
            "content"=>"การวัดความสามารถด้านการอ่านออกเสียง ควรใช้เครื่องมือในข้อใดจึงจะเหมาะสมที่สุด",
            "choice"=>[
                "ก. แบบทดสอบ",
                "ข. แบบสัมภาษณ์",
                "ค. แบบตรวจสอบรายการ",
                "ง. แบบมาตราส่วนประมาณค่า",
                "จ. แบบทดสอบความเข้าใจมโนมติ"
            ],
            "ans"=>"ค. แบบตรวจสอบรายการ"
        ],
        [
            "number"=>"ข้อที่ 26",
            "content"=>"ข้อใดมีความสำคัญที่สุดต่อการส่งเสริมการเรียนรู้ของผู้เรียน",
            "choice"=>[
                "ก. ให้ผู้เรียนรับผิดชอบต่อสังคมมากที่สุด",
                "ข. ให้ผู้เรียนมีส่วนร่วมและรับผิดชอบกิจกรรมมากที่สุด",
                "ค. ให้ผู้เรียนรับผิดชอบตนเองและปฏิบัติกิจกรรมมากที่สุด",
                "ง. ให้ผู้เรียนมีส่วนร่วมในการสร้างองค์ความรู้ด้วยตนเองมากที่สุด",
                "จ. ให้ผู้เรียนมีส่วนร่วมและเรียนรู้ด้วยตนเองจากสื่อต่าง ๆ มากที่สุด"
            ],
            "ans"=>"ง. ให้ผู้เรียนมีส่วนร่วมในการสร้างองค์ความรู้ด้วยตนเองมากที่สุด"
        ],
        [
            "number"=>"ข้อที่ 27",
            "content"=>"ข้อใดเป็นลักษณะของหลักสูตรสถานศึกษาที่เน้นผู้เรียนเป็นสำคัญ",
            "choice"=>[
                "ก. จัดเตรียมและวางแผนการจัดทำหลักสูตรอย่างเป็นระบบ",
                "ข. ตรวจสอบ กำกับ และติดตามผลการประเมินหลักสูตรอย่างต่อเนื่อง",
                "ค. กระจายความรับผิดชอบให้แก่ทุกฝ้ายในการจัดทำโครงร่างและประเมินหลัก",
                "ง. นำข้อมูลเกี่ยวกับพัฒนาการ ความต้องการ และความสนใจของผู้เรียนมากำหนดในหลักสูตร",
                "จ. ยึดหลักการมีส่วนร่วมของครอบครัว สถานศึกษา ชุมชน และสังคมในการบริหารสถานศึกษา"
            ],
            "ans"=>"ง. นำข้อมูลเกี่ยวกับพัฒนาการ ความต้องการ และความสนใจของผู้เรียนมากำหนดในหลักสูตร"
        ],
        [
            "number"=>"ข้อที่ 28",
            "content"=>"ข้อใดคือประโยชน์ที่เกิดจากกระบวนการพัฒนาหลักสูตรสถานศึกษาสำหรับครูผู้สอน",
            "choice"=>[
                "ก. ประพฤติตนเป็นพลเมืองดีของสังคม",
                "ข. ตรงกับสภาพปัญหาและความต้องการของชุมชน",
                "ค. ระบบการศึกษาก้าวหน้า ทันต่อการเปลี่ยนแปลง",
                "ง. สามารถจัดการเรียนการสอนให้บรรลุวัตถุประสงค์",
                "จ. พัฒนาการศึกษาให้สอดคล้องความเจริญของสังคมและโลก"
            ],
            "ans"=>"ง. สามารถจัดการเรียนการสอนให้บรรลุวัตถุประสงค์"
        ],
        [
            "number"=>"ข้อที่ 29",
            "content"=>"การกำหนดรายละเอียดในแต่ละองค์ประกอบของหลักสูตรควรพิจารณาสิ่งใดเป็นสำคัญ",
            "choice"=>[
                "ก. มาตรฐานและตัวชี้วัดของหลักสูตร",
                "ข. ทักษะการเรียนรู้และทักษะการดำเนินชีวิต",
                "ค. ความรู้ ทักษะ และคุณลักษณะอันพึงประสงค์",
                "ง. ความเหมาะสมกับบริบทของผู้เรียน ชุมชน และสังคม",
                "จ. คำอธิบายรายวิชาและจุดมุ่งหมายของหลักสูตรแกนกลาง"
            ],
            "ans"=>"ง. ความเหมาะสมกับบริบทของผู้เรียน ชุมชน และสังคม"
        ],
        [
            "number"=>"ข้อที่ 30",
            "content"=>"ข้อใดเป็นแนวทางการวิจัยและพัฒนาหลักสูตรเพื่อพัฒนาผู้เรียนหรือสร้างนวัตกรรมในสถานศึกษา",
            "choice"=>[
                "ก. สร้างนวัตกรรมต่อยอดจากผลการวิจัยและพัฒนาหลักสูตร",
                "ข. ประเมินตันทางเพื่อวิเคราะห์สาเหตุและแนวทางการพัฒนา",
                "ค. วิเคราะห์ผลการเรียนรู้เพื่อนำมาสร้างนวัตกรรมการจัดการเรียนรู้",
                "ง. ประเมินผู้เรียนเมื่อสิ้นสุดภาคเรียนเพื่อนำผลมาพัฒนาผู้เรียนรายกลุ่ม",
                "จ. ประเมินผู้เรียนอย่างต่อเนื่องเพื่อนำผลมาสร้างนวัตกรรมการจัดการเรียนรู้"
            ],
            "ans"=>"ก. สร้างนวัตกรรมต่อยอดจากผลการวิจัยและพัฒนาหลักสูตร"
        ]
    );
    echo json_encode($test, JSON_UNESCAPED_UNICODE);
?>